saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/NXP.MKL34Z4_DFP.10.0.3.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="common" condition="device.MKL34Z4_driver.common">
      <description>COMMON Driver</description>
      <files>
        <file name="drivers/fsl_common.c" category="sourceC"/>
        <file name="drivers/fsl_common.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="dma" condition="device.MKL34Z4_driver.common_driver.dmamux">
      <description>DMA Driver</description>
      <files>
        <file name="drivers/fsl_dma.c" category="sourceC"/>
        <file name="drivers/fsl_dma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.2" Csub="dmamux" condition="device.MKL34Z4_driver.common">
      <description>DMAMUX Driver</description>
      <files>
        <file name="drivers/fsl_dmamux.c" category="sourceC"/>
        <file name="drivers/fsl_dmamux.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="3.0.0" Csub="flash" condition="device.MKL34Z4">
      <description>Flash Driver</description>
      <files>
        <file name="drivers/fsl_flash.h" category="header"/>
        <file name="drivers/fsl_ftfx_adapter.h" category="header"/>
        <file name="drivers/fsl_ftfx_cache.c" category="sourceC"/>
        <file name="drivers/fsl_ftfx_cache.h" category="header"/>
        <file name="drivers/fsl_ftfx_controller.c" category="sourceC"/>
        <file name="drivers/fsl_ftfx_controller.h" category="header"/>
        <file name="drivers/fsl_ftfx_features.h" category="header"/>
        <file name="drivers/fsl_ftfx_flash.c" category="sourceC"/>
        <file name="drivers/fsl_ftfx_flash.h" category="header"/>
        <file name="drivers/fsl_ftfx_flexnvm.c" category="sourceC"/>
        <file name="drivers/fsl_ftfx_flexnvm.h" category="header"/>
        <file name="drivers/fsl_ftfx_utilities.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.2.1" Csub="gpio" condition="device.MKL34Z4_driver.common">
      <description>GPIO Driver</description>
      <files>
        <file name="drivers/fsl_gpio.c" category="sourceC"/>
        <file name="drivers/fsl_gpio.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.5" Csub="i2c" condition="device.MKL34Z4_driver.common">
      <description>I2C Driver</description>
      <files>
        <file name="drivers/fsl_i2c.c" category="sourceC"/>
        <file name="drivers/fsl_i2c.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.5" Csub="i2c_dma" condition="device.MKL34Z4_driver.dma_driver.i2c">
      <description>I2C Driver</description>
      <files>
        <file name="drivers/fsl_i2c_dma.c" category="sourceC"/>
        <file name="drivers/fsl_i2c_dma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="llwu" condition="device.MKL34Z4_driver.common">
      <description>LLWU Driver</description>
      <files>
        <file name="drivers/fsl_llwu.c" category="sourceC"/>
        <file name="drivers/fsl_llwu.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.4" Csub="lpsci" condition="device.MKL34Z4_driver.common">
      <description>LPSCI Driver</description>
      <files>
        <file name="drivers/fsl_lpsci.c" category="sourceC"/>
        <file name="drivers/fsl_lpsci.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.4" Csub="lpsci_dma" condition="device.MKL34Z4_driver.dma_driver.lpsci">
      <description>LPSCI Driver</description>
      <files>
        <file name="drivers/fsl_lpsci_dma.c" category="sourceC"/>
        <file name="drivers/fsl_lpsci_dma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="lptmr" condition="device.MKL34Z4_driver.common">
      <description>LPTMR Driver</description>
      <files>
        <file name="drivers/fsl_lptmr.c" category="sourceC"/>
        <file name="drivers/fsl_lptmr.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="pit" condition="device.MKL34Z4_driver.common">
      <description>PIT Driver</description>
      <files>
        <file name="drivers/fsl_pit.c" category="sourceC"/>
        <file name="drivers/fsl_pit.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="pmc" condition="device.MKL34Z4_driver.common">
      <description>PMC Driver</description>
      <files>
        <file name="drivers/fsl_pmc.c" category="sourceC"/>
        <file name="drivers/fsl_pmc.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.2" Csub="port" condition="device.MKL34Z4_driver.common">
      <description>PORT Driver</description>
      <files>
        <file name="drivers/fsl_port.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="rcm" condition="device.MKL34Z4_driver.common">
      <description>RCM Driver</description>
      <files>
        <file name="drivers/fsl_rcm.c" category="sourceC"/>
        <file name="drivers/fsl_rcm.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="rtc" condition="device.MKL34Z4_driver.common">
      <description>RTC Driver</description>
      <files>
        <file name="drivers/fsl_rtc.c" category="sourceC"/>
        <file name="drivers/fsl_rtc.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.0" Csub="sim" condition="device.MKL34Z4_driver.common">
      <description>SIM Driver</description>
      <files>
        <file name="drivers/fsl_sim.c" category="sourceC"/>
        <file name="drivers/fsl_sim.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="slcd" condition="device.MKL34Z4_driver.common">
      <description>SLCD Driver</description>
      <files>
        <file name="drivers/fsl_slcd.c" category="sourceC"/>
        <file name="drivers/fsl_slcd.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.3" Csub="smc" condition="device.MKL34Z4_driver.flash">
      <description>SMC Driver</description>
      <files>
        <file name="drivers/fsl_smc.c" category="sourceC"/>
        <file name="drivers/fsl_smc.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.4" Csub="spi" condition="device.MKL34Z4_driver.common">
      <description>SPI Driver</description>
      <files>
        <file name="drivers/fsl_spi.c" category="sourceC"/>
        <file name="drivers/fsl_spi.h" category="header"/>
      </files>
    </component>
